[
  {
    "company": "Hypori",
    "role": "Quality Assurance Test Engineer",
    "duration": "Apr 2024 - Present",
    "description": "I have been contributing to our Appium-based test automation framework using Java, where I developed and maintained comprehensive test cases and automated scripts. Additionally, I designed and integrated a Tesseract OCR implementation into the testing framework, enabling advanced optical character recognition capabilities that significantly improved test coverage and accuracy. I actively participate in code reviews and contribute to the enhancement of coding standards and best practices within the QA team."
  },
  {
    "company": "Sogeti",
    "role": "Software Engineer",
    "duration": "Aug 2022 - Oct 2023",
    "description": "I was a senior engineer on a team that concurrently delivered automation projects to multiple clients. I actively participated in all parts of the automation lifecycle, including leading process-discovery workshops, analyzing and documenting business processes, and successfully delivering automation solutions."
  },
  {
    "company": "Tietoevry",
    "role": "Senior Solutions Consultant (AI & Automation)",
    "duration": "Apr 2021 - Aug 2022",
    "description": "I designed and implemented automation workflows using UiPath and Blue Prism. My work included developing a C# solution that streamlined the management of sales orders for an international company by converting various international sales orders into a standardized format. Additionally, I successfully delivered a proof of concept for an intelligent document processing initiative."
  },
  {
    "company": "Capgemini",
    "role": "Intelligent Automation Consultant",
    "duration": "Sep 2018 - Mar 2021",
    "description": "I served as a consultant on the Intelligent Automation team, where I specialized in delivering Robotic Process Automation (RPA) solutions to our clients. Additionally, I led a week-long crash course designed to upskill new RPA developers within the organization."
  }
]
